app/controllers/home_controller.rb

  def index
    @paintings = Painting.all
---
SELECT "paintings".* FROM "paintings" ORDER BY "paintings"."id" ASC LIMIT $1  [["LIMIT", 1]]